#include <stdint.h>
#include <stdio.h>


// это функция которая получает температуру и влажность с датчика и возвращает адрес массива пикселей где они уже нарисованы


// индикатор занимает 20 x 120 слева, один : h - *капелька*, t - *градусник*
// номер или символ - 60 x 120 справа, до пяти : 0 1 2 3 4 5 6 7 8 9 . - *пробел*
// -1 0 1 2 3 4 
//  h 8 2 . 7
//  t 3 1 . 8  0
//  6 7 8 9 10 11

void add_buffer_symbol(uint16_t* buffer, char character, int8_t position, int16_t y)
{
    int x = (position < 5) ? (20 + position * 60) : (20 + (position - 7) * 60);

    // начало с x = 20 + position * 60 и y = y 
    // если позиция больше 5 - отнимаем от нее 7 - это значит она уже внизу и нужно опять начинать с нуля
    // добавляем 20 чтобы учеть кусок отнятый символами влажности или температуры. 
    // умножаем позицию на 60 потому что каждая позиция двигает x на 60
    // а y - он либо 0 либо 120.
    // тут мы всегда отступаем от края пару единиц.
    // формула индекса это x + y * ширина экрана

    switch (character)
    {


    case 'h':
        // рисуем символ h c 0,0 до 20,120
        for (int i = 2; i <= 18; i++) // этот рисует полоски по x. i здесь репрезентует x
        {
            buffer[i + 55 * 320] = 0xffff;
            buffer[i + 56 * 320] = 0xffff;
        }
        for (int i = 10; i <= 110; i++) // этот рисует полоски по y. i здесь репрезентует y
        {
            buffer[2 + i * 320] = 0xffff;
            buffer[3 + i * 320] = 0xffff;
            buffer[18 + i * 320] = 0xffff;
            buffer[19 + i * 320] = 0xffff;
        }
        break;


    case 't':
        // рисуем символ t c 0,120 до 20,240
        for (int i = 2; i <= 18; i++) // по x, i это x 
        {
            buffer[i + 230 * 320] = 0xffff;
            buffer[i + 229 * 320] = 0xffff;
        }
        for (int i = 130; i <= 230; i++) // по y, i это y
        {
            buffer[9 + i * 320] = 0xffff;
            buffer[10 + i * 320] = 0xffff;
        }
        break;


    case '0':
        // рисуем символ 0 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана
        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x - тут нужо 
        {
            buffer[i + (y + 110) * 320] = 0xffff;
            buffer[i + (y + 109) * 320] = 0xffff; // верхняя полоска

            buffer[i + (y + 10) * 320] = 0xffff;
            buffer[i + (y + 9) * 320] = 0xffff; // нижняя полоска
        }

        for (int i = y + 10; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 2 + i * 320] = 0xffff;
            buffer[x + 3 + i * 320] = 0xffff; // левая полоска

            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // правая полоска
        }
        break;


    case '1':
        // рисуем символ 1 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана

        for (int i = y + 10; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 29 + i * 320] = 0xffff;
            buffer[x + 30 + i * 320] = 0xffff;
            buffer[x + 31 + i * 320] = 0xffff; // палка
        }
        break;


    case '2':
        // рисуем символ 2 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана

        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 110) * 320] = 0xffff;
            buffer[i + (y + 109) * 320] = 0xffff; // верхняя полоска

            buffer[i + (y + 60) * 320] = 0xffff;
            buffer[i + (y + 59) * 320] = 0xffff; // серединная полоска

            buffer[i + (y + 10) * 320] = 0xffff;
            buffer[i + (y + 9) * 320] = 0xffff; // нижняя полоска
        }

        for (int i = y + 60; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // правая полупалка
        }

        for (int i = y + 10; i <= y + 60; i++) // этот рисует полоски по y
        {
            buffer[x + 3 + i * 320] = 0xffff;
            buffer[x + 2 + i * 320] = 0xffff; // левая полупалка
        }
        break;


    case '3':
        // рисуем символ 3 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана

        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 110) * 320] = 0xffff;
            buffer[i + (y + 109) * 320] = 0xffff; // верхняя полоска

            buffer[i + (y + 60) * 320] = 0xffff;
            buffer[i + (y + 59) * 320] = 0xffff; // серединная полоска

            buffer[i + (y + 10) * 320] = 0xffff;
            buffer[i + (y + 9) * 320] = 0xffff; // нижняя полоска
        }

        for (int i = y + 10; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // правая палка
        }
        break;


    case '4':
        // рисуем символ 4 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана

        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 60) * 320] = 0xffff;
            buffer[i + (y + 59) * 320] = 0xffff; // серединная полоска
        }

        for (int i = y + 10; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // правая палка
        }

        for (int i = y + 60; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 3 + i * 320] = 0xffff;
            buffer[x + 2 + i * 320] = 0xffff; // левая полупалка
        }
        break;


    case '5':
        // рисуем символ 5 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана

        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 110) * 320] = 0xffff;
            buffer[i + (y + 109) * 320] = 0xffff; // верхняя полоска

            buffer[i + (y + 60) * 320] = 0xffff;
            buffer[i + (y + 59) * 320] = 0xffff; // серединная полоска

            buffer[i + (y + 10) * 320] = 0xffff;
            buffer[i + (y + 9) * 320] = 0xffff; // нижняя полоска
        }

        for (int i = y + 60; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 3 + i * 320] = 0xffff;
            buffer[x + 2 + i * 320] = 0xffff; // правая полупалка
        }

        for (int i = y + 10; i <= y + 60; i++) // этот рисует полоски по y
        {
            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // левая полупалка
        }
        break;


    case '6':
        // рисуем символ 6 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана

        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 110) * 320] = 0xffff;
            buffer[i + (y + 109) * 320] = 0xffff; // верхняя полоска

            buffer[i + (y + 60) * 320] = 0xffff;
            buffer[i + (y + 59) * 320] = 0xffff; // серединная полоска

            buffer[i + (y + 10) * 320] = 0xffff;
            buffer[i + (y + 9) * 320] = 0xffff; // нижняя полоска
        }

        for (int i = y + 10; i <= y + 60; i++) // этот рисует полоски по y
        {
            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // правая полупалка
        }

        for (int i = y + 10; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 3 + i * 320] = 0xffff;
            buffer[x + 2 + i * 320] = 0xffff; // левая палка
        }
        break;


    case '7':
        // рисуем символ 7 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана

        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 110) * 320] = 0xffff;
            buffer[i + (y + 109) * 320] = 0xffff; // верхняя полоска
        }

        for (int i = y + 10; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // правая палка
        }
        break;


    case '8':
        // рисуем символ 8 со следующими параметрами
        // начало с x = 20 + position * 60 и y = y 
        // добавляем 20 чтобы учеть кусок отнятый символами влажности и температуры. 
        // умножаем позицию на 60 потому что каждая позиция двигает x на 60
        // с y - он либо 0 либо 120.
        // тут мы всегда отступаем от края пару единиц.
        // формула индекса это x + y * ширина экрана

        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 110) * 320] = 0xffff;
            buffer[i + (y + 109) * 320] = 0xffff; // верхняя полоска

            buffer[i + (y + 60) * 320] = 0xffff;
            buffer[i + (y + 59) * 320] = 0xffff; // серединная полоска

            buffer[i + (y + 10) * 320] = 0xffff;
            buffer[i + (y + 9) * 320] = 0xffff; // нижняя полоска
        }

        for (int i = y + 10; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // правая палка

            buffer[x + 3 + i * 320] = 0xffff;
            buffer[x + 2 + i * 320] = 0xffff; // левая палка палка
        }
        break;


    case '9':
        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 110) * 320] = 0xffff;
            buffer[i + (y + 109) * 320] = 0xffff; // верхняя полоска

            buffer[i + (y + 60) * 320] = 0xffff;
            buffer[i + (y + 59) * 320] = 0xffff; // серединная полоска
        }

        for (int i = y + 10; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 57 + i * 320] = 0xffff;
            buffer[x + 58 + i * 320] = 0xffff; // правая палка
        }

        for (int i = y + 60; i <= y + 110; i++) // этот рисует полоски по y
        {
            buffer[x + 3 + i * 320] = 0xffff;
            buffer[x + 2 + i * 320] = 0xffff; // левая полупалка
        }
        break;


    case '-':
        for (int i = x + 2; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 60) * 320] = 0xffff;
            buffer[i + (y + 59) * 320] = 0xffff; // серединная полоска
        }
        break;


    case '.':
        for (int i = x + 53; i <= x + 58; i++) // этот рисует полоски по x 
        {
            buffer[i + (y + 9) * 320] = 0xffff;
            buffer[i + (y + 10) * 320] = 0xffff; // серединная полоска
            buffer[i + (y + 11) * 320] = 0xffff;
            buffer[i + (y + 12) * 320] = 0xffff; // серединная полоска
        }
        break;


    case ' ':
        break;
    }
}

// у меня массив только одномерный. а рисую я в двухмерном пространстве 
// каким образом сделать массив двухмерным? как я могу сказать в массив "нужно написать на координате x y вот такой символ" либо
//
// вот ответ: формула индекса это x + y * ширина экрана



uint16_t* float_to_pixel_buffer(float humidity, float temperature)

{

    // переводим цифры в массив символов для удобной трансформации. объявляем эти массивы
    char humidity_in_characters[6];
    char temperature_in_characters[6];
    
    snprintf(humidity_in_characters, sizeof(humidity_in_characters), "%.1f", humidity);
    snprintf(temperature_in_characters, sizeof(temperature_in_characters), "%.1f", temperature);

    // теперь передаем эти символы в луп который сделает из каждого символа участок в буфере с нарисованным символом
    // humidity in characters[3] - последний номер.
    // temperature in characters[4] последний номер.
    //
    // проходим от -1 - чтобы влепить на -1 символы влажности или температуры и с нуля уже начать проход по элементам массива

    static uint16_t buffer[320 * 240] = {0}; // объявляем буффер и щас будем его обновлять по адресу.


    for (int8_t i = -1; i < 13 ; i ++) // их 12: 2 из них символы влажность или температура. 10 - собственно числа температуры. 1 - конец массива /0
    // конец массива всего один потому что до конца второго массива прога не дойдет
    // -1 символ  0 Вцифра  1 Вцифра  2 Вцифра  3 Вцифра  4 Вцифра  5 /0конец  6 символ  7 Тцифра  8 Тцифра  9 Тцифра  10 Тцифра   11 Тцифра
    {
        if(i < 5) // до 5 идет влажность
        {
            if(i == -1)
            {
                add_buffer_symbol(buffer, 'h', i, 0);
                continue;
            }
            add_buffer_symbol(buffer, humidity_in_characters[i], i, 0); // эту функцию как и символы надо записать в number_symbol
            continue;
        };

        if(i > 5) // после 5 идет температура . саму пятерку игнорируем, потому что под humidity_in_characters[5] будет /0
        {
            if(i == 6)
            {
                add_buffer_symbol(buffer, 't', i, 120);
                continue;
            }
            add_buffer_symbol(buffer, temperature_in_characters[i-7], i, 120 ); // тут i-7 потому что когда i дойдет до этого момента, он будет 7, а мы хотим начать с нулевого символа массива
        };
    };

    return buffer ;
};